---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryDir1WithSpacing
source: html/096f7ef0-97f7-4f54-6055-eb725c64921b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryDir1WithSpacing Property

"Major, Both Faces"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemLayerSummaryDir1WithSpacing { get; }
```